spec/fixtures/vcr_cassettes/Payments/retrieve/returns_payment_details.yml

---
http_interactions:
- request:
    method: get
    uri: https://public-demo-api.supercapital.uk/v1/payments/27?actingFor=148
    body:
      encoding: US-ASCII
      string: ''
    headers:
      X-Auth-Token: TOKEN
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 04 Jul 2016 15:03:22 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '788'
      Connection:
      - keep-alive
      X-Amzn-Requestid:
      - 736544a5-41f8-11e6-9172-4b37cfb01f3a
      X-Cache:
      - Miss from cloudfront
      Via:
      - 1.1 8ebc2b93de29d9744a950f4930f96579.cloudfront.net (CloudFront)
      X-Amz-Cf-Id:
      - kfcoSYZFaVAny5_Oizff_oerQa3JxbAEHY4ABQDwznwgDt5bfXJH_Q==
    body:
      encoding: UTF-8
      string: '{"id":27,"beneficiaryId":165,"amount":"10000.00","currency":"EUR","transferFeeCurrency":"GBP","paymentDate":"2016-07-04T00:00:00.000Z","paymentType":"local","reason":"property","reference":"Apartment
        123","status":"pending_release","beneficiary":{"id":165,"bankAccountHolderName":"Mark","beneficiaryCountry":"ES","bankCountry":"ES","currency":"EUR","beneficiaryAddress":"234
        Demo Street Name","bicSwift":"INGDESMM","iban":"ES9514650100981900000512","bankAddress":"CALLE
        SEVERO OCHOA 2,28232 LAS ROZAS DE MADRID","bankName":"ING BANK NV, SUCURSAL
        EN ESPANA (FORMERLY ING DIRECT NV, SUCURSAL EN ESPANA)","beneficiaryEntityType":"company","beneficiaryCompanyName":"Demo
        Inc.","beneficiaryCity":"New York","beneficiaryPostcode":"NY123","beneficiaryStateOrProvince":"NY","paymentType":"both"}}'
    http_version: 
  recorded_at: Mon, 04 Jul 2016 15:03:22 GMT
recorded_with: VCR 2.9.3
